{
  "blogs": [
    {
      "title": "My first blog",
      "body": "Server Components is an upcoming feature that allows developers to build apps that span the server and client, combining the rich interactivity of client-side apps with the improved performance of traditional server rendering. Server Components is not inherently coupled to Concurrent React, but it’s designed to work best with concurrent features like Suspense and streaming server rendering.At Meta, we’ve solved this problem by building React from the main branch, and manually updating it to a specific pinned commit every week. This is also the approach that React Native releases have been following for the last several years. Every stable release of React Native is pinned to a specific commit from the main branch of the React repository. This lets React Native include important bugfixes and incrementally adopt new React features at the framework level without getting coupled to the global React release schedule.Below we have provided both long and short paragraphs on pollution of varying word lengths. These paragraphs will provide you in depth knowledge of the issues regarding environmental pollution. After going through them you will be able to define pollution and its types, state their causes, effects, solution and also means to prevent them. You can also select a paragraph of your choice, for a speech, competition or debate as per your requirement.Environmental pollution refers to the presence of harmful and poisonous substances into our environment. It is not only limited to air pollution but can also affect water bodies, soil, forests, aquatic life and all the land living species as well. The main factors leading to environmental pollution are human generated.Environmental pollution refers to the presence of harmful and poisonous substances into our environment. It is not only limited to air pollution but can also affect water bodies, soil, forests, aquatic life and all the land living species as well. The main factors leading to environmental pollution are human generated.",
      "author": "Neha",
      "id": 1
    },
    {
      "title": "My second blog",
      "body": " At Meta, we’ve solved this problem by building React from the main branch, and manually updating it to a specific pinned commit every week. This is also the approach that React Native releases have been following for the last several years. Every stable release of React Native is pinned to a specific commit from the main branch of the React repository. This lets React Native include important bugfixes and incrementally adopt new React features at the framework level without getting coupled to the global React release schedule. Server Components is an upcoming feature that allows developers to build apps that span the server and client, combining the rich interactivity of client-side apps with the improved performance of traditional server rendering. Server Components is not inherently coupled to Concurrent React, but it’s designed to work best with concurrent features like Suspense and streaming server rendering.Pollution has tremendous adverse affects on environment, resulting in its degradation and also in depletion of living species. It has severe after effects like acid rain, global warming, famine, draught and extreme climatic conditions along with other consequences. The most common type of pollution is air pollution. The air we breathe today in metropolis or cities is choked with toxic CO (Carbon Monoxide, CO2 (Carbon di- oxide), N2O (Nitrous Oxide) and CH4 (Methane). Inhalation of these gases not only leads to respiratory ailments in humans but also CO2 is a potent green house gas leading to escalated green house effect and global warming.Transportation industry causes 25% of the global green house gas emission; subsequently, resulting in green house effect and a raised earth’s average surface temperature. Earth’s average surface temperature is constantly rising and is estimated to rise by around 1.8 by the end of present century. Even the temperature of oceans is on rise, though at a slower rate owing to the ocean’s larger heat absorbing capacity.",
      "author": "Tina",
      "id": 2
    },
    {
      "title": "My third blog",
      "body": " At Meta, we’ve solved this problem by building React from the main branch, and manually updating it to a specific pinned commit every week. This is also the approach that React Native releases have been following for the last several years. Every stable release of React Native is pinned to a specific commit from the main branch of the React repository. This lets React Native include important bugfixes and incrementally adopt new React features at the framework level without getting coupled to the global React release schedule. Server Components is an upcoming feature that allows developers to build apps that span the server and client, combining the rich interactivity of client-side apps with the improved performance of traditional server rendering. Server Components is not inherently coupled to Concurrent React, but it’s designed to work best with concurrent features like Suspense and streaming server rendering.Pollution has tremendous adverse affects on environment, resulting in its degradation and also in depletion of living species. It has severe aftereffects like acid rain, global warming, famine, draught and extreme climatic conditions along with other consequences. The most common type of pollution is air pollution. The air we breathe today in metropolis or cities is choked with toxic CO (Carbon Monoxide, CO2 (Carbon di- oxide), N2O (Nitrous Oxide) and CH4 (Methane). Inhalation of these gases not only leads to respiratory ailments in humans but also CO2 is a potent green house gas leading to escalated green house effect and global warming.Transportation industry causes 25% of the global green house gas emission; subsequently, resulting in green house effect and a raised earth’s average surface temperature. Earth’s average surface temperature is constantly rising and is estimated to rise by around 1.8 by the end of present century. Even the temperature of oceans is on rise, though at a slower rate owing to the ocean’s larger heat absorbing capacity.",
      "author": "Tina",
      "id": 3
    },
    {
      "title": "my fourth blog",
      "body": "this is my fourth blog",
      "author": "Neha",
      "id": 6
    },
    {
      "title": "my fifth blog",
      "body": "this is blog body fifth",
      "author": "Neha",
      "id": 7
    },
    {
      "title": "blog 7",
      "body": "this is my blog body 7",
      "author": "Vikas",
      "id": 9
    }
  ],
  "products": [
    {
      "title": "My first product",
      "body": "This is my product 1",
      "author": "Neha",
      "id": 3
    },
    {
      "title": "My second product",
      "body": "This is my product 2",
      "author": "Tina",
      "id": 4
    }
  ]
}